# Core CLI
brew "git"
brew "zsh"
brew "tmux"
brew "neovim"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"
brew "delta"
brew "jq"
brew "direnv"
brew "gh"
brew "watchman"

# Runtimes
brew "node"
brew "pnpm"
brew "python@3.12"
brew "rustup-init"
brew "go"

# Fonts
tap  "homebrew/cask-fonts"
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "raycast"
cask "ghostty"
cask "orbstack"

